{
  "WorkshopId": 2448571322,
  "Title": "Qud-Fu - Mixed Martial Arts Skills",
  "Description": "[h1][[THIS IS A BETA EXCLUSIVE MOD ((FOR NOW)) AND WILL NOT WORK ON THE STABLE RELEASE.]][/h1]\r\n\r\n[i]“The contenders are here, time to test our resolve.”[/i]\r\nArshira, Master of the Dawning-Fist Ryu.\r\n\r\n[h1]Features:[/h1]\r\n\t\r\n\tA Hand-to-Hand Skill tree containing but not limited to:\r\n\r\n[list]\r\n[*] A built-in Combo System: By landing consecutive blows and penetrations, the fighter builds a combo meter that synchronizes damage and other traits the higher it gets! Try to maintain your combo counter to dish out serious damage!\r\n\r\n[*] Various Conditioning Skills: Condition your *body* to be the *weapon,* skills falling under conditioning affect your hardiness as a warrior with increased stamina, speed, and resistances to stun, damage and various other ailments.\r\n\r\n[*] Special Actions: Throw out sure-strikes, or gain bonuses to performing combo elements integrating natural equipment like stingers and burrowing claws to truly improve your combat performance.\r\n\r\n[*] Martial Stances: Learn Martial Stances that open up avenues to creative playstyles, fight with the ferocity and relentlessness of a dawn-glider, the cunning and stealthy nature of a Astral Tabby, or turtle-up and become like the unmovable Salt-Back.With five styles (and more to come) and stance synergy you can manage multiple stances with improve each other as you grow to become the MMA master you’ve always wanted to be!\r\n[/list]\r\n\r\n[b][u]Other Features:[/u][/b]\r\n\r\n[list]\r\n[*] A New Faction: A New faction has come to Qud, with a new starting caste to boot known as the Braver Contenders. This mysterious group of warriors struggle to improve and leave their mark in a cruel and unforgiving world, and to become warrior legends of their own right. The Contenders have many goals based on the individual sub-factions related to each school of martial training. With one even content with sparring and defeating Oboroqoru, the Ape God whose legendary mighty fist strike both fear and respect through their ranks, no contender would give up the chance to say they have tussled with them. You may also run into creature’s that have been trained in one of the various martial school’s ways, so watch out!\r\n\r\n[*] New Items: New items and gear related to the various factions, adding some new flavour to the item list pool.\r\n\r\n[*] Books and Lore: Books and lore, some of which instruct the player on the various martial forms and their origins. \r\n[/list]\r\n\r\n\r\n[b][u]Upcoming Additions:[/u][/b]\r\n\r\n[list]\r\n[*] New Martial Styles: A Grappling Class is on the way, in the spirit of the Death Dacca.\r\n\r\n[*] Item Mods: Special Item mods that will allow for using various weapons alongside the stance system, making them compatible with hand-to-hand bonuses. This will mostly be attributable to daggers, and other small weaponry.\r\n\r\n[*] More Lore, books and even dojo’s acting as sacred places for each contender school.\r\n[/list]\r\n\r\n\r\n[b][u]Feature Breakdown:[/u][/b]\r\n\r\nThere’s a lot to explain with this mod, so I’m going to leave a lot of stuff to the players to find out as I find that’s part of what makes it fun.\r\n\r\nInvolving stances, stance synergy isn’t actually depicted however each stance that is unlocked, adds special abilities to other stances and/or expounds on a stance based on what it does performance wise. One example is, the Salt-Hopper path buffs the Slumberling path, by giving it damage bonuses on stunned or dazed opponents. Through chaining styles through stance mastery, one can up their level of fun by engaging in mixed attacks. \r\n\r\nIf you start in Joppa, the Joppa merchant will carry a book that can give a bit of information into each martial style.\r\n\r\nThough this isn’t implemented yet, eventually the cost of learning styles will be increased and encourage the player to seek out the various dojo’s and masters, to learn the various Martial Styles.\r\n\r\n[b][u]Compatibility:[/u][/b]\r\n\r\nThough I haven’t tested, this shouldn’t be incompatible with anything in particular.\r\n\r\n[b][u]Credits:[/u][/b]\r\nThanks to various members on who tested and helped out with scripting logic, such as Gnarf, Emong, Autumn, MsShadowy, Armithaig, IceCubeGames, Kinzy, helado, Eva Problems, Ivy Melinda and many others who tested the mod and I might of forgotten.\r",
  "Tags": "Skill, MMA, Martial Arts, Qud-Fu",
  "Visibility": "2",
  "ImagePath": "preview.png"
}